{
  "pageTitle": "Imanshu Rathore's - Resume",
  "profile": {
    "firstName": "imanshu",
    "lastName": "rathore",
    "designation": [
      "Frontend Engineer",
      "React.js Developer",
      "JavaScript Developer"
    ],
    "description": [
      "I'm a software engineer with more than 2 years of experience in software development. I believe in developing modern, reactive and user friendly web applications using the latest technologies.",
      "I believe a perfect blend of software design is one, where the goals and needs are accounted for in an elegant, efficient and robust design of the software.",
      "If I am not working then there is a high chance that I am busy potting pool balls with my cue or leading my player for a Winner Winner Chicken Dinner!",
      "Scroll down to know more about me!"
    ],
    "resume": "https://drive.google.com/uc?id=11rcKwVOYSRMLk8Hz1wmp2TVn3OfGOOqg&export=download",
    "socialLinks": [
      {
        "icon": "mail",
        "value": "imanshurathore@gmail.com",
        "link": true,
        "href": "mailto:imanshurathore@gmail.com"
      },
      {
        "icon": "mobile",
        "value": "7837770661",
        "link": false
      },
      {
        "icon": "location",
        "value": "Chandigarh, India",
        "link": false
      },
      {
        "icon": "linkedin",
        "value": "linkedin.com/in/imanshurathore/",
        "link": true,
        "href": "https://www.linkedin.com/in/imanshurathore/",
        "target": "_blank"
      }
    ]
  },
  "skills": {
    "technical": [
      "React.js",
      "JavaScript ES6+",
      "TypeScript",
      "HTML5",
      "CSS3",
      "SCSS",
      "Redux.js",
      "Redux Saga",
      "Express.js",
      "Node.js",
      "Git",
      "Adobe Photoshop",
      "WebPack",
      "Jest/Enzyme",
      "System Design",
      "Data Structures & Algorithms"
    ],
    "soft": [
      "Fluent Communicator",
      "Active Listening",
      "Collaborative",
      "Multitasking",
      "Time Management",
      "Persuasive",
      "Rapport Building",
      "Ability to Work Under Pressure",
      "Problem Solving",
      "Brainstorming"
    ]
  },
  "workExperience": [
    {
      "company": "paytm payments bank",
      "startDate": "February, 2021",
      "designation": "software engineer",
      "location": "Noida, India",
      "responsibilities": [
        "Design and develop new features/requirements by translating given Wire-frames into Web Components that meets markup standards, cross-browser compatibility, usability principles and accessibility.",
        "Develop reusable and modular UI components utilizing Preact and Storybook, define accessibility and governance and rollout the components across the Paytm Web Components library.",
        "Enhanced overall web application performance by optimizing the critical rendering path, reducing page load time and improving performance metrics such as FCP, FMP and TTI etc from 82% to 90%.",
        "Handling the interface layer (Backend For Frontend) for integrating/tailoring the distributed multi microservice architecture with the web-application and achieving a combination of static side generation and server side rendering.",
        "Improved web application security by composing middleware’s to prevent various attacks such as CSRF, XSS, CSP and Click-Jacking etc which diminshed the attacks from 7% to 4.2%.",
        "Collaborate with team to design, develop, test and refine expected deliverables that meet the objectives and quality standards across multiple releases."
      ]
    },
    {
      "company": "GlobalLogic",
      "startDate": "October, 2019",
      "endDate": "January, 2021",
      "designation": "associate software engineer",
      "location": "Noida, India",
      "responsibilities": [
        "Designed and developed the Web Application where user can compare and purchase insurance plans for their pets for a pet insurance company, PetPlan.",
        "Ported the frontend of content management system application from JSP pages in Spring framework to React Web Components in MVC architecture for a content engagement platform provider, Naviga which increased the user engagement by 85%.",
        "Developed the coach and student web panel for an internal product, Career Path which helps the employees to track their career progression and schedule meetings with career coaches.",
        "Assisted senior developers in performing code reviews and implementing improvement plans.",
        "Acclimated to new technologies and situations with the vision of providing best customer experience."
      ]
    }
  ],
  "education": [
    {
      "startDate": "August, 2015",
      "endDate": "May, 2019",
      "school": "Seth Jai Prakash Mukand Lal Institue of Engineering and Technology",
      "degree": "Bachelor of Technology",
      "stream": "Computer Science Engineering",
      "location": "Yamunanagar, India",
      "score": "Percentile - 74.4%"
    },
    {
      "startDate": "March, 2013",
      "endDate": "April, 2014",
      "school": "Guru Nanak Khalsa Senior Secondary School",
      "degree": "Higher Secondary",
      "stream": "Science",
      "location": "Chandigarh, India",
      "score": "Percentile - 81.0%"
    },
    {
      "startDate": "March, 2011",
      "endDate": "April, 2012",
      "school": "Bhavan Vidyalaya",
      "degree": "Matriculation",
      "location": "Panchkula, India",
      "score": "CGPA - 9.4"
    }
  ]
}
